In [1]:
import pandas as pd

In [3]:
data = {
    "one": [1, 2, 3, 4, 5],
    "two": [11, 22, 33, 44, 55],
    "three": [111, 222, 333, 444, 555],
}

df = pd.DataFrame(data)

df

   one  two  three
0    1   11    111
1    2   22    222
2    3   33    333
3    4   44    444
4    5   55    555

# Create

In [5]:
# normal 

df.to_csv("create_numbers.csv")

In [ ]:
# with othe parameters 

df.to_csv("create_numbers_params.csv", index = False, headers = [1, 2, 3])